tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/system/blockMeshDict
/* Cong2017 B-H3 2-D fine mesh. Paper lengths/diameters; planar area-ratio caveat. */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

// target dx=0.002 dy_pipe=0.00178571 dy_riser=0.002
// approx cells = 111435

vertices
(
    (0 0 -0.002)
    (0 0 0.002)
    (0 0.05 -0.002)
    (0 0.05 0.002)
    (3.457 0 -0.002)
    (3.457 0 0.002)
    (3.457 0.05 -0.002)
    (3.457 0.05 0.002)
    (3.483 0 -0.002)
    (3.483 0 0.002)
    (3.483 0.05 -0.002)
    (3.483 0.05 0.002)
    (5.98 0 -0.002)
    (5.98 0 0.002)
    (5.98 0.05 -0.002)
    (5.98 0.05 0.002)
    (6.59 0 -0.002)
    (6.59 0 0.002)
    (6.59 0.05 -0.002)
    (6.59 0.05 0.002)
    (3.457 3 -0.002)
    (3.457 3 0.002)
    (3.483 3 -0.002)
    (3.483 3 0.002)
);

blocks
(
    hex (0 4 6 2 1 5 7 3) (1728 28 1) simpleGrading (1 1 1)
    hex (4 8 10 6 5 9 11 7) (13 28 1) simpleGrading (1 1 1)
    hex (8 12 14 10 9 13 15 11) (1249 28 1) simpleGrading (1 1 1)
    hex (12 16 18 14 13 17 19 15) (305 28 1) simpleGrading (1 1 1)
    hex (6 10 22 20 7 11 23 21) (13 1475 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 3 1)
        );
    }

    closedEnd
    {
        type wall;
        faces
        (
            (16 17 19 18)
        );
    }

    walls
    {
        type wall;
        faces
        (
            // invert
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            // soffit outside riser
            (2 6 7 3)
            (10 14 15 11)
            (14 18 19 15)
            // riser side walls
            (6 7 21 20)
            (10 22 23 11)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (20 22 23 21)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            // front zm
            (0 4 6 2)
            (4 8 10 6)
            (8 12 14 10)
            (12 16 18 14)
            (6 10 22 20)
            // back zp
            (1 3 7 5)
            (5 7 11 9)
            (9 11 15 13)
            (13 15 19 17)
            (7 21 23 11)
        );
    }
);

// ************************************************************************* //
