tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  laminar;
