tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/constant/thermophysicalProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.01528;
    }
    equationOfState
    {
        // perfectFluid uses rho=rho0+p/(R*T).  These values give rho=998
        // kg/m3 at 101325 Pa and K=rho*R*T=2.2 GPa at 296.15 K.
        R           7443.55501481;
        rho0        997.954035295;
    }
    thermodynamics
    {
        Cp          4182;
        Hf          0;
    }
    transport
    {
        mu          9.33e-4;
        Pr          7.0;
    }
}
