tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    closedEnd
    {
        type            noSlip;
    }
    walls
    {
        type            noSlip;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

}
