tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/0.orig/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 296.15;
boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 296.15;
    }
    closedEnd
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 296.15;
        value           uniform 296.15;
    }

    frontAndBack
    {
        type            empty;
    }

}
