tests/test_02_cong2017/cases/BH3_Dr26_H066_L061/openfoam/2d/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 107786.651
    volScalarFieldValue p 107786.651
    volScalarFieldValue T 296.15
);

regions
(
    // air above free surface (whole domain)
    boxToCell
    {
        box (-1 0.66 -1) (10 4.0 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 101325.0
            volScalarFieldValue p 101325.0
        );
    }

    // full-bore air pocket downstream of release plane (paper L0)
    boxToCell
    {
        box (5.98 -1 -1) (10 4.0 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 101325.0
            volScalarFieldValue p 101325.0
        );
    }
);
